---
kind: property
id: P:Autodesk.Revit.DB.FillPattern.Target
source: html/6806fd05-a364-5cd1-a545-7891a4f71b86.htm
---
# Autodesk.Revit.DB.FillPattern.Target Property

Target of this fill pattern applied to.

## Syntax (C#)
```csharp
public FillPatternTarget Target { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration